k = int( input() )
if (k == 3) or (k == 5) or (k == 6) or (k > 7):
    print( "YES" )
else:
    print( "NO" )
# В кафе мороженое продают по три шарика и по пять шариков.
# Можно ли купить ровно k шариков мороженого?
# Формат ввода Вводится число k (целое,положительное)
# Формат вывода Программа должна вывести слово YES,
# если при таких условиях можно набрать ровно k шариков
# (не больше и не меньше), в противном случае - вывести NO.
