a = int( input() )
b = int( input() )
c = int( input() )
if a >= b and a >= c:
    print( a )
elif b >= a and b >= c:
    print( b )
elif c >= a and c >= b:
    print( c )
# eyes = int(input())
# legs = int(input())
# if eyes >= 8:
#     if legs == 8:
#         print("spider")
#     else:
#         print("scallop")
# else:
#     if legs == 6:
#         print("bug")
#     else:
#         print("cat")

# Даны три целых числа. Найдите наибольшее из них
# (программа должна вывести ровно одно целое число).
#
# Какое наименьшее число операторов сравнения
# (>, <, >=, <=) необходимо для решения этой задачи?
