a1 = int( input() )
a2 = int( input() )
b1 = int( input() )
b2 = int( input() )
if (a1 + a2 + b1 + b2) % 2 == 0:
    print( 'YES' )
else:
    print( 'NO' )

# Заданы две клетки шахматной доски.
# Если они покрашены в один цвет,
# то выведите слово YES, а если в разные цвета – то NO.
# Формат ввода
# Вводятся 4 числа - координаты клеток.
